_posts/2015-11-25-LDAP-lookups-from-Emacs.html
---
title: LDAP lookups from Emacs
date: 2015/11/25 09:31:58
updated: 2015/11/25 09:31:58
categories: emacs,helm
tags: 
---



<p>
Now that I have email and Cisco Jabber totally integrated into Emacs it would be nice to tap into the CMU LDAP (Lightweight Directory Access Protocol) service  to find emails and phone numbers. We to use the ldapsearch command-line utility to query our LDAP service like this to find an email address.
</p>

<p>
You might like the video explanation here: <a href="https://www.youtube.com/watch?v=N7AaKHRd9uw">https://www.youtube.com/watch?v=N7AaKHRd9uw</a> 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(shell-command-to-string <span style="color: #008000;">"ldapsearch -x -LLL -h ldap.andrew.cmu.edu -b ou=Person,dc=cmu,dc=edu cn=\"John Kitchin\""</span>)
</pre>
</div>

<pre class="example">
dn: guid=1976CCAA-B465-11D8-8000-080020CC75D3,ou=person,dc=cmu,dc=edu
objectClass: cmuPerson
eduPersonPrimaryAffiliation: Faculty
guid: 1976CCAA-B465-11D8-8000-080020CC75D3
cmuPrivate: homePostalAddress
cmuPrivate: homePhone
cn: John Kitchin
givenName: John
sn: Kitchin
cmuPrimaryCampus: Pittsburgh
cmuCampus: Pittsburgh
cmuAndrewId: jkitchin
cmueduId: jkitchin
cmuAndrewCommonNamespaceId: jkitchin
mail: jkitchin@cmu.edu
eduPersonSchoolCollegeName: CIT - Consolidated
cmuPersonPrincipalName: jkitchin@ANDREW.CMU.EDU
postalAddress: DH A207F
cmuDepartment: Chemical Engineering
cmuDepartment: MSE: Materials Science &amp; Engineering
cmuPersonAffiliation: Tenure-Track Faculty
eduPersonAffiliation: Faculty
cmuAccount: uid=jkitchin,ou=account,dc=andrew,dc=cmu,dc=edu
cmuAccount: uid=jkitchin,ou=account,dc=cmu,dc=edu
cmuActiveDN: uid=jkitchin,ou=account,dc=andrew,dc=cmu,dc=edu
cmuActiveDN: uid=jkitchin,ou=account,dc=cmu,dc=edu
title: Professor
telephoneNumber: +1 412 268 7803
</pre>

<p>
We actually get LDIF data from ldapsearch with a lot of details. Next we wrap the output in a function that converts each result from ldapsearch into a p-list that we will use later in a helm function to help us select a match.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">ldap-query</span> (query-string)
  <span style="color: #036A07;">"Send QUERY-STRING to our ldap server and parse results into a</span>
<span style="color: #036A07;">list of p-lists for each entry returned."</span>
  (<span style="color: #0000FF;">interactive</span> <span style="color: #008000;">"sLDAP query: "</span>)
  (<span style="color: #0000FF;">let</span> ((output (butlast (split-string
                          (shell-command-to-string
                           (format (concat  <span style="color: #008000;">"ldapsearch -x -LLL "</span>
                                            <span style="color: #008000;">"-h ldap.andrew.cmu.edu "</span>
                                            <span style="color: #008000;">"-b ou=Person,dc=cmu,dc=edu %s"</span>)
                                   query-string))
                          <span style="color: #008000;">"\n"</span>)))
        (lines '())
        (result '())
        (results '(())))
    <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">cleanup trailing lines and ignore initial lines</span>
    (<span style="color: #0000FF;">loop</span> for line in output
          do
          (<span style="color: #0000FF;">cond</span>
           <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">join lines that run over</span>
           ((s-starts-with? <span style="color: #008000;">" "</span> line)
            (<span style="color: #0000FF;">setf</span> (car (last lines))
                  (concat (car (last lines)) line)))
           <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">ignore this</span>
           ((string-match <span style="color: #008000;">"Size limit exceeded"</span> line)
            nil)
           (t
            (add-to-list 'lines line t))))

    <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">now we need to parse the lines. A new entry starts with a dn: line.</span>
    (<span style="color: #0000FF;">dolist</span> (line lines)
      (<span style="color: #0000FF;">cond</span>
       ((s-starts-with? <span style="color: #008000;">"dn:"</span> line)
        <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">add new entry</span>
        (add-to-list 'results `(<span style="color: #006FE0;">:dn</span> ,line)))
       ((string-match <span style="color: #008000;">":"</span> line)
        (<span style="color: #0000FF;">let*</span> ((s (split-string line <span style="color: #008000;">":"</span>))
               (prop (intern (concat <span style="color: #008000;">":"</span> (s-trim (car s)))))
               (val (s-trim (cadr s))))
          (<span style="color: #0000FF;">setf</span> (car results) (plist-put (car results) prop val))))))
    <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">last result seems to be nil so we drop it</span>
    (-filter (<span style="color: #0000FF;">lambda</span> (x) (not (null x))) results)))
</pre>
</div>

<pre class="example">
ldap-query
</pre>

<p>
Here is an example of that function:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(ldap-query <span style="color: #008000;">"cn=\"John Kitchin\""</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">((<span style="color: #006FE0;">:dn</span> <span style="color: #008000;">"dn: guid=1976CCAA-B465-11D8-8000-080020CC75D3,ou=person,dc=cmu,dc=edu"</span> <span style="color: #006FE0;">:objectClass</span> <span style="color: #008000;">"cmuPerson"</span> <span style="color: #006FE0;">:eduPersonPrimaryAffiliation</span> <span style="color: #008000;">"Faculty"</span> <span style="color: #006FE0;">:guid</span> <span style="color: #008000;">"1976CCAA-B465-11D8-8000-080020CC75D3"</span> <span style="color: #006FE0;">:cmuPrivate</span> <span style="color: #008000;">"homePhone"</span> <span style="color: #006FE0;">:cn</span> <span style="color: #008000;">"John Kitchin"</span> <span style="color: #006FE0;">:givenName</span> <span style="color: #008000;">"John"</span> <span style="color: #006FE0;">:sn</span> <span style="color: #008000;">"Kitchin"</span> <span style="color: #006FE0;">:cmuPrimaryCampus</span> <span style="color: #008000;">"Pittsburgh"</span> <span style="color: #006FE0;">:cmuCampus</span> <span style="color: #008000;">"Pittsburgh"</span> <span style="color: #006FE0;">:cmuAndrewId</span> <span style="color: #008000;">"jkitchin"</span> <span style="color: #006FE0;">:cmueduId</span> <span style="color: #008000;">"jkitchin"</span> <span style="color: #006FE0;">:cmuAndrewCommonNamespaceId</span> <span style="color: #008000;">"jkitchin"</span> <span style="color: #006FE0;">:mail</span> <span style="color: #008000;">"jkitchin@cmu.edu"</span> <span style="color: #006FE0;">:eduPersonSchoolCollegeName</span> <span style="color: #008000;">"CIT - Consolidated"</span> <span style="color: #006FE0;">:cmuPersonPrincipalName</span> <span style="color: #008000;">"jkitchin@ANDREW.CMU.EDU"</span> <span style="color: #006FE0;">:postalAddress</span> <span style="color: #008000;">"DH A207F"</span> <span style="color: #006FE0;">:cmuDepartment</span> <span style="color: #008000;">"MSE"</span> <span style="color: #006FE0;">:cmuPersonAffiliation</span> <span style="color: #008000;">"Tenure-Track Faculty"</span> <span style="color: #006FE0;">:eduPersonAffiliation</span> <span style="color: #008000;">"Faculty"</span> <span style="color: #006FE0;">:cmuAccount</span> <span style="color: #008000;">"uid=jkitchin,ou=account,dc=cmu,dc=edu"</span> <span style="color: #006FE0;">:cmuActiveDN</span> <span style="color: #008000;">"uid=jkitchin,ou=account,dc=cmu,dc=edu"</span> <span style="color: #006FE0;">:title</span> <span style="color: #008000;">"Professor"</span> <span style="color: #006FE0;">:telephoneNumber</span> <span style="color: #008000;">"+1 412 268 7803"</span>))
</pre>
</div>


<p>
Now, we wrap a helm function around that to give us a nice menu to select entries from, and a few actions like sending an email, calling, copying the name and email, and seeing the information in a reasonable way. We also add a fallback method in case we don't find what we want and need to do a new search.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">helm-ldap</span> (query-string)
  (<span style="color: #0000FF;">interactive</span> <span style="color: #008000;">"sLDAP query: "</span>)
  (helm
   <span style="color: #006FE0;">:sources</span>
   `(((name . <span style="color: #008000;">"HELM ldap"</span>)
      (candidates . ,(mapcar
                      (<span style="color: #0000FF;">lambda</span> (x)
                        (cons
                         (format
                          <span style="color: #008000;">"%20s|%30s|%30s|%20s|%s"</span>
                          (s-truncate
                           20
                           (<span style="color: #0000FF;">or</span> (plist-get x <span style="color: #006FE0;">:title</span>) <span style="color: #008000;">" "</span>))
                          (plist-get x <span style="color: #006FE0;">:cn</span>)
                          (plist-get x <span style="color: #006FE0;">:mail</span>)
                          (plist-get x <span style="color: #006FE0;">:cmuDisplayAddress</span>)
                          (<span style="color: #0000FF;">or</span> (plist-get x <span style="color: #006FE0;">:telephoneNumber</span>) <span style="color: #008000;">" "</span>))
                         x))
                      (ldap-query
                       (<span style="color: #0000FF;">if</span> (string-match <span style="color: #008000;">"="</span> query-string)
                           query-string
                         (concat <span style="color: #008000;">"cn=*"</span> query-string <span style="color: #008000;">"*"</span>)))))
      (action . ((<span style="color: #008000;">"Email"</span> . (<span style="color: #0000FF;">lambda</span> (x)
                              (compose-mail)
                              (message-goto-to)
                              (insert (plist-get x <span style="color: #006FE0;">:mail</span>))
                              (message-goto-subject)))
                 (<span style="color: #008000;">"Call"</span> . (<span style="color: #0000FF;">lambda</span> (x)
                             (cisco-call
                              (plist-get x <span style="color: #006FE0;">:telephoneNumber</span>))))
                 (<span style="color: #008000;">"Copy Name and email address"</span> . (<span style="color: #0000FF;">lambda</span> (x)
                                                    (kill-new
                                                     (format
                                                      <span style="color: #008000;">"%s &lt;%s&gt;"</span>
                                                      (plist-get x <span style="color: #006FE0;">:cn</span>)
                                                      (plist-get x <span style="color: #006FE0;">:mail</span>)))))
                 (<span style="color: #008000;">"Information"</span> . (<span style="color: #0000FF;">lambda</span> (x)
                                    (switch-to-buffer
                                     (get-buffer-create <span style="color: #008000;">"*helm ldap*"</span>))
                                    (erase-buffer)
                                    (<span style="color: #0000FF;">dolist</span> (key (<span style="color: #0000FF;">cl-loop</span>
                                                  for key in x by #'cddr
                                                  collect key))
                                      (insert (format <span style="color: #008000;">"|%s | %s|\n"</span>
                                                      key (plist-get x key))))
                                    (org-mode)
                                    (goto-char 0)
                                    (org-ctrl-c-ctrl-c)
                                    (insert <span style="color: #008000;">"press q to quit.\n\n"</span>)
                                    (<span style="color: #0000FF;">setq</span> buffer-read-only t)
                                    (use-local-map (copy-keymap org-mode-map))
                                    (local-set-key <span style="color: #008000;">"q"</span>
                                                   #'(lambda ()
                                                       (<span style="color: #0000FF;">interactive</span>)
                                                       (quit-window t))))))))
     <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">fallback action</span>
     ((name . <span style="color: #008000;">"New search"</span>)
      (dummy)
      (action . (<span style="color: #0000FF;">lambda</span> (x) (helm-ldap x)))))))
</pre>
</div>

<pre class="example">
helm-ldap
</pre>

<p>
That is pretty convenient!
</p>

<p>
John Kitchin &lt;jkitchin@cmu.edu&gt;</p>
<p>Copyright (C) 2015 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2015/11/25/LDAP-lookups-from-Emacs.org">org-mode source</a><p><p>Org-mode version = 8.2.10</p>